# Raw data to clean date conversion

### Method-1

In [1]:
import pandas as pd

In [2]:
data1=pd.read_excel(r"C:\Users\HP\OneDrive\Desktop\Dataset\datacleaning task.xlsx")

In [3]:
data1

                                      address       date      time
0  56th,ben colony,btm layout,banglore, 78909 2022-04-03  05:55:23
1  20th, johns road, whitefield, banglore,567 2021-12-06  19:18:59

In [4]:
data1[["door","street","colony","city","picode"]]=data1["address"].str.split(',',expand=True)
data1["date"]=data1["date"].astype('str')
data1[["yr","mth","day"]]=data1["date"].str.split('-',expand=True)
data1["time"]=data1["time"].astype('str')
data1[["hr","min","sec"]]=data1["time"].str.split(':',expand=True)
data1

,address,date,time,door,street,colony,city,picode,yr,mth,day,hr,min,sec
0,"56th,ben colony,btm layout,banglore, 78909",2022-04-03,05:55:23,56th,ben colony,btm layout,banglore,78909,2022,04,03,05,55,23
1,"20th, johns road, whitefield, banglore,567",2021-12-06,19:18:59,20th,johns road,whitefield,banglore,567,2021,12,06,19,18,59

### Method 2

In [5]:
data=pd.read_excel(r"C:\Users\HP\OneDrive\Desktop\Dataset\raw.xlsx")

In [6]:
data

                                      address           date              time
0  56th,ben colony,btm layout,banglore, 78909   3rd apr 2022  05hr 55min 23sec
1  20th, johns road, whitefield, banglore,567  06th dec 2021  19hr 18min 59sec

In [7]:
data[["door","street","colony","city","picode"]]=data["address"].str.split(',',expand=True)
data[["yr","mth","day"]]=data["date"].str.split(expand=True)
data[["hr","min","sec"]]=data["time"].str.split(expand=True)
data

,address,date,time,door,street,colony,city,picode,yr,mth,day,hr,min,sec
0,"56th,ben colony,btm layout,banglore, 78909",3rd apr 2022,05hr 55min 23sec,56th,ben colony,btm layout,banglore,78909,3rd,apr,2022,05hr,55min,23sec
1,"20th, johns road, whitefield, banglore,567",06th dec 2021,19hr 18min 59sec,20th,johns road,whitefield,banglore,567,06th,dec,2021,19hr,18min,59sec